"""
Created on Sat Apr  2 21:24:18 2022

Тонкое проволочное кольцо радиусом 𝑅 = 4 см равномерно 
заряжено с линейной плотностью 𝜆 = 1 нКл/м (лекция).
Определите напряженность 𝐸 электростатического поля 

@author: valeria
"""
import math
import matplotlib.pyplot as plt

R = 4 * (10 ** (-2))
ly = 1 * (10 ** (-9))
e0 = 8.85 * (10 ** (-12))

x = []
y = []

v = int(input('Определите напряженность E электростатического поля:\n 1. На расстоянии 𝑟 = 0.1 м на оси, перпендикулярной плоскости кольца и проходящей через центр кольца;\n 2. В центре кольца;\n 3. На каком расстоянии от центра кольца на оси симметрии напряженность поля будет максимальной?\n 4. Минимальной?\n 5. Постройте график зависимости 𝑬(𝒓)\n Укажите номер задания: '))

if v == 1:
    r = 0.1
    E = (1 / (4 * math.pi * e0)) * ((2 * math.pi * r * R * ly) / ((r ** 2) + (R ** 2) ** (3 / 2)))
    print('E =', round(E, 2))

elif v == 2:
    r = 0
    E = (1 / (4 * math.pi * e0)) * ((2 * math.pi * r * R * ly) / ((r ** 2) + (R ** 2) ** (3 / 2)))
    print('E =', round(E, 2))

elif v == 3:
    r = 0.1
    E = (1 / (4 * math.pi * e0)) * ((2 * math.pi * r * R * ly) / ((r ** 2) + (R ** 2) ** (3 / 2)))
    print('При r =', r, 'максимальное E =', round(E, 2))

elif v == 4:
    r = 0
    E = (1 / (4 * math.pi * e0)) * ((2 * math.pi * r * R * ly) / ((r ** 2) + (R ** 2) ** (3 / 2)))
    print('При r =', r, 'минимальное E =', round(E, 2))

elif v == 5:
    for r in range(1, 20):
        E = (1 / (4 * math.pi * e0)) * ((2 * math.pi * r * R * ly) / ((r ** 2) + (R ** 2) ** (3 / 2)))
        x.append(r)
        y.append(E)
        
    print('E =', round(E, 2))
    print('r =', r)

    plt.plot(x, y)
    plt.show()

else: 
    print('Неверное значение')
    